In [3]:
import pandas as pd

In [4]:
employees = [
  {
    "id": 1,
    "first_name": "Jayne",
    "last_name": "Burchmore",
    "email": "jburchmore0@unicef.org",
    "gender": "Female",
    "yearly_salary": 78395,
    "years_of_experience": 23
  },
  {
    "id": 2,
    "first_name": "Anna",
    "last_name": "De Paoli",
    "email": "adepaoli1@t.co",
    "gender": "Female",
    "yearly_salary": 102972,
    "years_of_experience": 28
  },
  {
    "id": 3,
    "first_name": "Abbott",
    "last_name": "Itzchaki",
    "email": "aitzchaki2@bloglovin.com",
    "gender": "Male",
    "yearly_salary": 178876,
    "years_of_experience": 12
  },
]

In [5]:
df_from_emplyess_list = pd.DataFrame(employees)
df_from_emplyess_list

# Alapértelmezett index
# Pandas alapértelmezetten egy RangeIndex-et használ, ami egy 0-tól kezdődő egész szám sorozat:

# 0, 1, 2, 3, stb.
# Ez automatikusan létrejön, amikor DataFrame-et hozol létre
# Minden sorhoz egy sorszám rendelődik
# Nem egyedi indexek
# A komment ("index is not always unique") arra utal, hogy az index értékek nem feltétlenül egyediek:

# Pandas megengedi az ismétlődő indexértékeket - nem kényszeríti ki az egyediséget
# Amikor egy oszlopot indexként használsz (set_index), és abban ismétlődő értékek vannak, az index is ismétlődő lesz
# Akkor is ha két df-et kombinálsz az automatikus indexelés miatt ugyanazon idexek lesznek használva

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12

In [6]:
# index is not always unique
# Ha inplace=True:
  # Az eredeti DataFrame közvetlenül módosul
  # Nincs szükség az eredmény visszaadására
  # A függvény None értéket ad vissza
  # Memóriát takarít meg, mivel nem készít másolatot
  # A változások azonnal láthatóak az eredeti változóban
# Ha inplace=False (alapértelmezett):
  # Az eredeti DataFrame változatlan marad
  # Új DataFrame-et hoz létre és ad vissza
  # A változások megtartásához a visszatérési értéket egy változóba kell menteni
  # Átmenetileg több memóriát használ
df_from_emplyess_list.set_index('email', inplace=True)

In [7]:
df_from_emplyess_list.index

Index(['jburchmore0@unicef.org', 'adepaoli1@t.co', 'aitzchaki2@bloglovin.com'], dtype='object', name='email')

In [8]:
df_from_emplyess_list.loc['jburchmore0@unicef.org']

id                             1
first_name                 Jayne
last_name              Burchmore
gender                    Female
yearly_salary              78395
years_of_experience           23
Name: jburchmore0@unicef.org, dtype: object

In [9]:
employees_dict = {
    "id": [1, 2, 3],
    "first_name": ["Jayne", "Anna", "Abbott"],
    "last_name": ["Burchmore", "De Paoli", "Itzchaki"],
    "email": ["jburchmore0@unicef.org", "adepaoli1@t.co", "aitzchaki2@bloglovin.com"],
    "gender": ["Female", "Female", "Male"],
    "yearly_salary": [78395, 102972, 178876],
    "years_of_experience": [23, 28, 12]
}

In [10]:
df_from_eployees_dict = pd.DataFrame(employees_dict)
df_from_eployees_dict

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12

In [11]:
employees_list = [
    [1, "Jayne", "Burchmore", "jburchmore0@unicef.org", "Female", 78395, 23],
    [2, "Anna", "De Paoli", "adepaoli1@t.co", "Female", 102972, 28],
    [3, "Abbott", "Itzchaki", "aitzchaki2@bloglovin.com", "Male", 178876, 12]
]

columns = ["id", "first_name", "last_name", "email", "gender", "yearly_salary", "years_of_experience"]

In [12]:
df_from_two_dimensional_list = pd.DataFrame(employees_list, columns=columns)
df_from_two_dimensional_list

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12

In [ ]:

# JSON from string
json_str = """[
  {"id": 1, "name": "John", "department": "IT"},
  {"id": 2, "name": "Anna", "department": "HR"},
  {"id": 3, "name": "Peter", "department": "IT"}
]"""

df_json_str = pd.read_json(json_str)
df_json_str

C:\Users\pryan\AppData\Local\Temp\ipykernel_19744\3375890055.py:7: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df_json_str = pd.read_json(json_str)

   id   name department
0   1   John         IT
1   2   Anna         HR
2   3  Peter         IT